# .copy()

In [310]:
#deep copy: copy smth in memory address into another memory address
#shallow copy: both variables refer to the same memory address so both change if one is changed

In [311]:
x = 'python_copy'

In [312]:
x

'python_copy'

In [313]:
y=x

In [314]:
y

'python_copy'

In [315]:
y= y.replace('p','t')

In [316]:
y

'tython_coty'

In [317]:
x

'python_copy'

In [318]:
# changed y but x remained same. This is deep copy

In [319]:
ls1 = list(x)

In [320]:
ls1

['p', 'y', 't', 'h', 'o', 'n', '_', 'c', 'o', 'p', 'y']

In [321]:
ls2 = ls1

In [322]:
ls2

['p', 'y', 't', 'h', 'o', 'n', '_', 'c', 'o', 'p', 'y']

In [323]:
ls2.append('99')

In [324]:
ls2

['p', 'y', 't', 'h', 'o', 'n', '_', 'c', 'o', 'p', 'y', '99']

In [325]:
ls1

['p', 'y', 't', 'h', 'o', 'n', '_', 'c', 'o', 'p', 'y', '99']

In [326]:
# this is shallow copy as when we changed ls2, ls1 also changed

In [327]:
# shallow copy occurs in lists,

In [328]:
import numpy as np
import pandas as pd

In [329]:
data = pd.read_csv('C:/Users/abuba/Downloads/innovista/day 2/Lending-company.csv', index_col='LoanID')

In [330]:
data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [331]:
lending_co_Data = data.copy() # this leads to deep copy

In [332]:
data2 = data # this leads to shallow copy

In [333]:
data.iloc[0,1] = 'Product D'

In [334]:
data2.iloc[0,1]

'Product D'

In [335]:
# we changed dataframe data which also lead to data2 changing

In [336]:
lending_co_Data.iloc[0,1]

'Product B'

In [337]:
# however this did not change proving this is a deep copy

In [338]:
df = pd.read_csv('test.csv')

In [339]:
df

   Sr.no   Name  Gender  Age
0      1  Aslam    male   22
1      2   Sara  female   38
2      3  Ahmad    male   26
3      4   Amna  female   35

In [340]:
import json

In [341]:
help(json.dump)
# df.to_json

Help on function dump in module json:

dump(obj, fp, *, skipkeys=False, ensure_ascii=True, check_circular=True, allow_nan=True, cls=None, indent=None, separators=None, default=None, sort_keys=False, **kw)
    Serialize ``obj`` as a JSON formatted stream to ``fp`` (a
    ``.write()``-supporting file-like object).

    If ``skipkeys`` is true then ``dict`` keys that are not basic types
    (``str``, ``int``, ``float``, ``bool``, ``None``) will be skipped
    instead of raising a ``TypeError``.

    If ``ensure_ascii`` is false, then the strings written to ``fp`` can
    contain non-ASCII characters if they appear in strings contained in
    ``obj``. Otherwise, all such characters are escaped in JSON strings.

    If ``check_circular`` is false, then the circular reference check
    for container types will be skipped and a circular reference will
    result in an ``RecursionError`` (or worse).

    If ``allow_nan`` is false, then it will be a ``ValueError`` to
    serialize out of range ``float`` values (``nan``, ``inf``, ``-inf``)
    in strict compliance of the JSON specification, instead of using the
    JavaScript equivalents (``NaN``, ``Infinity``, ``-Infinity``).

    If ``indent`` is a non-negative integer, then JSON array elements and
    object members will be pretty-printed with that indent level. An indent
    level of 0 will only insert newlines. ``None`` is the most compact
    representation.

    If specified, ``separators`` should be an ``(item_separator, key_separator)``
    tuple.  The default is ``(', ', ': ')`` if *indent* is ``None`` and
    ``(',', ': ')`` otherwise.  To get the most compact JSON representation,
    you should specify ``(',', ':')`` to eliminate whitespace.

    ``default(obj)`` is a function that should return a serializable version
    of obj or raise TypeError. The default simply raises TypeError.

    If *sort_keys* is true (default: ``False``), then the output of
    dictionaries will be sorted by key.

    To use a custom ``JSONEncoder`` subclass (e.g. one that overrides the
    ``.default()`` method to serialize additional types), specify it with
    the ``cls`` kwarg; otherwise ``JSONEncoder`` is used.

In [342]:
df.to_json('test.json') # converts df into a json file and saves it as test.json

In [343]:
df.to_json()

'{"Sr.no":{"0":1,"1":2,"2":3,"3":4},"Name":{"0":"Aslam","1":"Sara","2":"Ahmad","3":"Amna"},"Gender":{"0":"male","1":"female","2":"male","3":"female"},"Age":{"0":22,"1":38,"2":26,"3":35}}'

In [344]:
# another way to save json

In [345]:
json_data = '''Sr.no,Name,Gender,Age
1,"Aslam",male,22
2,"Sara",female,38
3,"Ahmad",male,26
4,"Amna",female,35'''

In [346]:
json_data

'Sr.no,Name,Gender,Age\n1,"Aslam",male,22\n2,"Sara",female,38\n3,"Ahmad",male,26\n4,"Amna",female,35'

In [347]:
print(json_data)

Sr.no,Name,Gender,Age
1,"Aslam",male,22
2,"Sara",female,38
3,"Ahmad",male,26
4,"Amna",female,35

In [348]:
from io import StringIO
obj = StringIO(json_data)
pd.read_csv(obj)

   Sr.no   Name  Gender  Age
0      1  Aslam    male   22
1      2   Sara  female   38
2      3  Ahmad    male   26
3      4   Amna  female   35

# Handling Mising Data

In [349]:
json_data = '''Sr.no,Name,Gender,Age
1,NA,male,22
2,"Sara",NA,38
3,"Ahmad",male,26
4,"Amna",female,35'''

In [350]:
obj = StringIO(json_data)
pd.read_csv(obj)

   Sr.no   Name  Gender  Age
0      1    NaN    male   22
1      2   Sara     NaN   38
2      3  Ahmad    male   26
3      4   Amna  female   35

In [351]:
sentinels = {'Gender':['male', 'NA']}
df = pd.read_csv('test.csv', na_values=sentinels)

In [352]:
df

   Sr.no   Name  Gender  Age
0      1  Aslam     NaN   22
1      2   Sara  female   38
2      3  Ahmad     NaN   26
3      4   Amna  female   35

In [353]:
df.dropna() # removes any row with NA

   Sr.no  Name  Gender  Age
1      2  Sara  female   38
3      4  Amna  female   35

In [354]:
df.dropna(how='all') # drops only those rows were all cells are NaN

   Sr.no   Name  Gender  Age
0      1  Aslam     NaN   22
1      2   Sara  female   38
2      3  Ahmad     NaN   26
3      4   Amna  female   35

In [355]:
df.dropna(how='any') # this is the default setting. if u leave how empty as in the line before the all one, it will remove any row with NaN

   Sr.no  Name  Gender  Age
1      2  Sara  female   38
3      4  Amna  female   35

In [356]:
df.fillna('M')

   Sr.no   Name  Gender  Age
0      1  Aslam       M   22
1      2   Sara  female   38
2      3  Ahmad       M   26
3      4   Amna  female   35

In [357]:
# fills the missing values with a value

In [358]:
pd.read_json('test.json') # how to read from json files

   Sr.no   Name  Gender  Age
0      1  Aslam    male   22
1      2   Sara  female   38
2      3  Ahmad    male   26
3      4   Amna  female   35

In [359]:
data = {"Sr.no":{"0":1,"1":2,"2":3,"3":4},"Name":{"0":"Aslam","1":"Sara","2":"Ahmad","3":"Amna"},"Gender":{"0":"male","1":"female","2":"male","3":"female"},"Age":{"0":22,"1":38,"2":26,"3":35}}

In [360]:
df1 = pd.DataFrame(data)

In [361]:
df1

   Sr.no   Name  Gender  Age
0      1  Aslam    male   22
1      2   Sara  female   38
2      3  Ahmad    male   26
3      4   Amna  female   35

In [362]:
data = pd.read_csv('C:/Users/abuba/Downloads/innovista/day 2/Lending-company.csv', index_col='LoanID')

In [363]:
data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [364]:
data.describe() # har numeric column ka count, mean, standard variation, mid, 25%, 50% and 75% between min and max, and max

,TotalPrice,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360
count,1018.000000,1043.000000,1043.000000,1043.0,1043.000000,1043.000000,1043.000000
mean,19562.843811,2528.092042,50.834132,365.0,3901.857143,5214.393097,17122.131352
std,5955.588065,1504.467724,11.567390,0.0,2537.597667,2850.327133,5910.916736
min,13475.000000,1000.000000,30.000000,365.0,-2770.000000,-2945.000000,650.000000
25%,16300.000000,2200.000000,45.000000,365.0,2840.500000,3822.000000,15560.500000
50%,17600.000000,2200.000000,45.000000,365.0,3420.000000,4742.000000,16617.000000
75%,20950.000000,2200.000000,55.000000,365.0,5075.500000,6393.000000,19977.500000
max,70225.000000,8000.000000,150.000000,365.0,18851.000000,22143.000000,65001.000000

In [365]:
data

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1039,LoanID_1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
1040,LoanID_1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
1041,LoanID_1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
1042,LoanID_1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
1043,LoanID_1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

In [366]:
data.nunique() # ysed in dataframe to tell how much uniqey data in each column e.g in Product there are 6 unique data, A,B,C,D,E,F,.

StringID          1043
Product              6
CustomerGender       3
Location           296
Region              18
TotalPrice          24
StartDate          742
Deposit              5
DailyRate            5
TotalDaysYr          1
AmtPaid36          455
AmtPaid60          612
AmtPaid360         458
LoanStatus           3
dtype: int64

In [367]:
type(data.nunique())

pandas.core.series.Series

In [368]:
data['Deposit'].unique() # unique is used for series, shows all unique values in series

array([2200, 1000, 5000, 3000, 8000], dtype=int64)

# Modifying

In [369]:
df = pd.DataFrame([['a','b'], ['c','d'], ['e','f'], ['g','h']], columns = ['col1','col2'])

In [370]:
df

  col1 col2
0    a    b
1    c    d
2    e    f
3    g    h

In [371]:
df.iloc[2:4,1] = ['x','y']

In [372]:
df

  col1 col2
0    a    b
1    c    d
2    e    x
3    g    y

In [373]:
df.iloc[2:4,1] = 'x'

In [374]:
df

  col1 col2
0    a    b
1    c    d
2    e    x
3    g    x

In [375]:
df.rename(index={2 :'r2', 3 : 'r3' })

   col1 col2
0     a    b
1     c    d
r2    e    x
r3    g    x

In [376]:
df.loc[2]

col1    e
col2    x
Name: 2, dtype: object

In [377]:
help(df.insert)

Help on method insert in module pandas.core.frame:

insert(loc: 'int', column: 'Hashable', value: 'Scalar | AnyArrayLike', allow_duplicates: 'bool | lib.NoDefault' = <no_default>) -> 'None' method of pandas.core.frame.DataFrame instance
    Insert column into DataFrame at specified location.

    Raises a ValueError if `column` is already contained in the DataFrame,
    unless `allow_duplicates` is set to True.

    Parameters
    ----------
    loc : int
        Insertion index. Must verify 0 <= loc <= len(columns).
    column : str, number, or hashable object
        Label of the inserted column.
    value : Scalar, Series, or array-like
        Content of the inserted column.
    allow_duplicates : bool, optional, default lib.no_default
        Allow duplicate column labels to be created.

    See Also
    --------
    Index.insert : Insert new item by index.

    Examples
    --------
    >>> df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
    >>> df
       col1  col2
    0     1     3
    1     2     4
    >>> df.insert(1, "newcol", [99, 99])
    >>> df
       col1  newcol  col2
    0     1      99     3
    1     2      99     4
    >>> df.insert(0, "col1", [100, 100], allow_duplicates=True)
    >>> df
       col1  col1  newcol  col2
    0   100     1      99     3
    1   100     2      99     4

    Notice that pandas uses index alignment in case of `value` from type `Series`:

    >>> df.insert(0, "col0", pd.Series([5, 6], index=[1, 2]))
    >>> df
       col0  col1  col1  newcol  col2
    0   NaN   100     1      99     3
    1   5.0   100     2      99     4

In [378]:
df.insert(2,"col3", [99,99,99,99])

In [379]:
df

  col1 col2  col3
0    a    b    99
1    c    d    99
2    e    x    99
3    g    x    99

In [380]:
help(df.drop)

Help on method drop in module pandas.core.frame:

drop(labels: 'IndexLabel | None' = None, *, axis: 'Axis' = 0, index: 'IndexLabel | None' = None, columns: 'IndexLabel | None' = None, level: 'Level | None' = None, inplace: 'bool' = False, errors: 'IgnoreRaise' = 'raise') -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by directly specifying index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the :ref:`user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        in place and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        Returns DataFrame or None DataFrame with the specified
        index or column labels removed or None if inplace=True.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    llama   speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    llama   speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [381]:
df.drop(2, inplace= True)

In [382]:
df

  col1 col2  col3
0    a    b    99
1    c    d    99
3    g    x    99

In [383]:
df.drop(['col1'], axis=1)

  col2  col3
0    b    99
1    d    99
3    x    99